# список образовательных программ
programs = ["Экономика", "Бизнес-информатика", "Туризм"]
# список дисциплин
subjects = ["Эконометрика", "Базы данных", "Теория игр", "Программирование на Python"]
# список олимпиад и конкурсов
olymp_compet = ["Всероссийская олимпиада по обществознанию для студентов СПО «Права человека»",
                "Всероссийская олимпиада для студентов по дисциплине «Техническое черчение»",
                "Всероссийская олимпиада для студентов: «Основные понятия технологии разработки программ»",
                "Конкурс бизнес-проектов «Бизнес-кейс 2022»",
                "Конкурс студентов «В мире науки»",
                "Конкурс студентов «Экономика и менеджмент»"
                ]
# словарь с описанием дисциплины
subject_dict = {"Эконометрика": "наука, изучающая количественные и качественные экономические взаимосвязи с помощью статистических и других математических методов и моделей.",
                "Базы данных": "упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе.",
                "Теория игр": "математический метод изучения оптимальных стратегий в играх. ",
                "Программирование на Python": "высокоуровневый язык программирования общего назначения, который используется в том числе и для разработки веб-приложений."
                }
olymp_dict = {"Всероссийская олимпиада по обществознанию для студентов СПО «Права человека»": "К участию в олимпиаде по обществознанию, допускаются студенты 1-5 курсов образовательных учебных заведений РФ, стран СНГ. Олимпиада проводится дистанционно. Олимпиадные задания составлены с учетом ФГОС и содержат 15 вопросов с выбором ответа. В каждом предлагаемом задании может быть только один верный ответ. Оплата происходит только после введения ответов!",
              "Всероссийская олимпиада для студентов по дисциплине «Техническое черчение»": "Всероссийская олимпиада для студентов по дисциплине по предмету «Техническое черчение» предназначена для студентов 1 - 5 курсов всех учебных заведений РФ. Задание олимпиады содержит 10 тестовых вопросов с возможностью выбора одного правильного ответа. После прохождения олимпиады Вы можете оформить подтверждающий документ участия в олимпиаде.",
                "Всероссийская олимпиада для студентов: «Основные понятия технологии разработки программ»": "Олимпиада предназначена для студентов всех учебных заведений РФ. Задание олимпиады содержит 10 тестовых вопросов с возможностью выбора одного правильного ответа. После прохождения олимпиады Вы можете оформить подтверждающий документ участия в олимпиаде.",
                "Конкурс бизнес-проектов «Бизнес-кейс 2022»": "Позвольте предложить вам принять участие в масштабном проекте, главная задача которого – показать широкой аудитории производственных менеджеров практические примеры решения реальных проблем на производстве. Не менее важная задача проекта – показать бизнес-сообществу, какие компании и кто именно из профессионалов уже имеет достаточно опыта решения таких задач. Этот проект уже выдержал проверку временем – он регулярно проводится нами с 2012 года.",
                "Конкурс студентов «В мире науки»": "Для оценки конкурсных работ Оргкомитетом создаются предметные комиссии по каждому направлению. На первом этапе каждая научно-исследовательская работа оценивается двумя независимыми экспертами. На основании результатов экспертизы, члены предметных комиссий на втором этапе рассматривают работы и подводят итоги конкурса. Результаты конкурса на каждом направлении оформляются протоколом предметных комиссий за подписью председателя предметной комиссии. Состав привлеченных экспертов является закрытым и не разглашается, а решения предметной комиссии не могут быть оспорены участниками конкурса. ",
                "Конкурс студентов «Экономика и менеджмент»": "В рамках конференции ЭКОПРОМ-2022 проводится конкурс научных работ для студентов и аспирантов. Конкурс проводится по двум направлениям: Экономика и Менеджмент. По каждому направлению определяются победители, которые награждаются дипломами 1, 2, 3-й степени. Победителям, получившим максимальные оценки, кроме диплома 1-й степени вручается медаль Новожилова В.В. (Экономика) и медаль Глухова В.В. (Менеджмент). Победителям предоставляется право разместить по результатам рецензирования материалы исследований в соавторстве с научным руководителем в виде статьи в журнале ВАК «Научно-технические ведомости СПбПУ. Экономические науки»."
              }